In [58]:
import pandas as pd
from persiantools.jdatetime import JalaliDate as jd
import datetime as dt

In [59]:
dateTimeKey='DATE_TIME'
dateKey='DATE'
timeKey='TIME'
idKey='ID'

In [60]:
data=pd.read_csv('result.csv')
data.head()

   INDEX         ID        DATE      TIME
0      0   Alikhani  1401-01-01  10:09:00
1      1   Alikhani  1401-01-01  10:13:00
2      2    Pazooki  1401-01-01  17:17:00
3      3  Aryaeifar  1401-01-01  17:18:00
4      4      Arast  1401-01-15  17:12:00

In [61]:
#reshaping 
uniqueIds=data[idKey].unique()
uniqueDates=data[dateKey].unique()
exportingDataFrame=pd.DataFrame()
#we will set uniqueIds to columns and uniqueDates to rows to exportingDataFrame
exportingDataFrame['DATE']=uniqueDates
for i in range(len(uniqueIds)):
    exportingDataFrame[uniqueIds[i]]=0
exportingDataFrame.head()

,DATE,Alikhani,Pazooki,Aryaeifar,Arast,Javadi,Hoseini,AliAryai,Forootan,Motalleb
0,1401-01-01,0,0,0,0,0,0,0,0,0
1,1401-01-15,0,0,0,0,0,0,0,0,0
2,1401-01-06,0,0,0,0,0,0,0,0,0
3,1401-01-07,0,0,0,0,0,0,0,0,0

In [64]:
#we will explode DATE_TIME column
for index,row in data.iterrows():
    #we will get set items of exportingData frame from date and id of data
    exportingDataFrame.loc[exportingDataFrame['DATE']==row[dateKey],row[idKey]]=row[timeKey]

In [68]:
exportingDataFrame.head()

,DATE,Alikhani,Pazooki,Aryaeifar,Arast,Javadi,Hoseini,AliAryai,Forootan,Motalleb
0,1401-01-01,10:13:00,17:17:00,17:18:00,0,0,0,0,0,0
1,1401-01-15,0,0,0,17:15:00,0,0,0,0,0
2,1401-01-06,0,19:06:00,17:23:00,19:02:00,0,0,0,0,0
3,1401-01-07,10:45:00,09:12:00,09:08:00,09:23:00,08:17:00,08:22:00,10:45:00,10:03:00,14:44:00